tutorials/viscoelasticFluidFoam/DCPP/constant/viscoelasticProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          viscoelasticProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
From:
CLEMEUR, N.; RUTGERS, R. P. G.; DEBBAUT, B. Numerical simulation of abrupt
contraction flows using the double convected pom-pom model. Journal of Non-
Newtonian Fluid Mechanics, v. 117, n. 2-3, p. 193-209, 2004.

Table 1
Parameters for the four-mode DCPP models
Mode     1        2        3        4
G (Pa)   5.15e4   1.11e4   2.08e3   6.61e1
l (s)    0.02     0.2      2        20

DCPP1
lob/los  2        2        2        1
q        1        1        6        18
zeta     0.2      0.2      0.07     0.05

*/


rheology
{

       type multiMode;

        models
        (

                first
                {
                type DCPP;
                rho              rho [1 -3 0 0 0 0 0] 820;
                etaS             etaS [1 -1 -1 0 0 0 0] 0.002;
                etaP             etaP [1 -1 -1 0 0 0 0] 1.03e3;
                lambdaOb         lambdaOb [0 0 1 0 0 0 0] 0.02;
                lambdaOs         lambdaOs [0 0 1 0 0 0 0] 0.01;
                zeta             zeta [0 0 0 0 0 0 0] 0.2;
                q                q [0 0 0 0 0 0 0] 1.0;
                }

                second
                {
                type DCPP;
                rho              rho [1 -3 0 0 0 0 0] 820;
                etaS             etaS [1 -1 -1 0 0 0 0] 0.002;
                etaP             etaP [1 -1 -1 0 0 0 0] 2.22e3;
                lambdaOb         lambdaOb [0 0 1 0 0 0 0] 0.2;
                lambdaOs         lambdaOs [0 0 1 0 0 0 0] 0.1;
                zeta             zeta [0 0 0 0 0 0 0] 0.2;
                q                q [0 0 0 0 0 0 0] 1.0;
                }

                third
                {
                type DCPP;
                rho              rho [1 -3 0 0 0 0 0] 820;
                etaS             etaS [1 -1 -1 0 0 0 0] 0.002;
                etaP             etaP [1 -1 -1 0 0 0 0] 4.16e3;
                lambdaOb         lambdaOb [0 0 1 0 0 0 0] 2.0;
                lambdaOs         lambdaOs [0 0 1 0 0 0 0] 1.0;
                zeta             zeta [0 0 0 0 0 0 0] 0.07;
                q                q [0 0 0 0 0 0 0] 6.0;
                }

                fourth
                {
                type DCPP;
                rho              rho [1 -3 0 0 0 0 0] 820;
                etaS             etaS [1 -1 -1 0 0 0 0] 0.002;
                etaP             etaP [1 -1 -1 0 0 0 0] 1.322e3;
                lambdaOb         lambdaOb [0 0 1 0 0 0 0] 20.0;
                lambdaOs         lambdaOs [0 0 1 0 0 0 0] 20.0;
                zeta             zeta [0 0 0 0 0 0 0] 0.05;
                q                q [0 0 0 0 0 0 0] 18.0;
                }

       );


}



// ************************************************************************* //
